#!/usr/bin/env python 
#-*- coding:utf-8 -*-

import random,sys

reload(sys)
sys.setdefaultencoding('utf-8')


kdata = ["秋の他のかりほの庵の苫をあらみ",
"春過ぎて夏来にけらし白妙の",
"あしびきの山鳥の尾のしだり尾の",
"田子の浦にうちいでて見れば白妙の",
"奥山にもみぢふみわけ鳴く鹿の",
"かささぎの渡せる橋におく霜の",
"天の原ふりさけ見れば春日なる",
"わが庵は都のたつみしかぞすむ",
"花の色はうつりにけりないたづらに",
"これやこの行くも帰るもわかれては",
"わたの原八十島かけてこぎいでぬと",
"天つ風雲のかよひ路吹きとぢよ",
"つくばねの峰よりおつるみなの川",
"みちのくのしのぶもぢずり誰ゆゑに",
"君がため春の野にいでて若菜つむ",
"立ちわかれいなばの山の峰に生ふる",
"ちはやぶる神代もきかず竜田川",
"すみの江の岸に寄る波よるさへや",
"難波潟みじかき葦のふしのまも",
"わびぬればいまはたおなじ難破なる",
"いま来むといひしばかりに長月の",
"吹くからに秋の草木のしをるれば",
"月見ればちぢに物こそかなしけれ",
"このたびは幣もとりあへず手向山",
"名にしおはば逢う坂山のさねかづら",
"小倉山峰のもみぢば心あらば",
"みかの原わきて流るるいづみ川",
"山里は冬ぞさびしきさまりける",
"こころあてに折らばや折らむ",
"ありあけのつれなく見えし別れより",
"朝ぼらけありあけの月と見るまでに",
"山川に風のかけたるしがらみは",
"ひさかたの光のどけき春の日に",
"誰をかも知る人にせむ高砂の",
"人はいさ心もしらずふるさとは",
"夏の夜はまだ宵ながら明けぬるを",
"白露に風の吹きしく秋の野は",
"忘らるる身をば思はずちかひてし",
"浅芽生の小野の篠原しのぶれど",
"しのぶれど色にいでにけりわが恋は",
"恋すてふ我が名はまだき立ちにけり",
"ちぎりきなかたみに袖をしぼりつつ",
"あひみてののちの心にくらぶれば",
"あふことのたえてしなくはなかなかに",
"あはれともいふべき人は思ほえで",
"由良のとをわたる舟人かぢを絶え",
"八重むぐらしげれる宿のさびしさに",
"風をいたみ岩うつ波のおのれのみ",
"みかきもり衛士のたく火の夜は燃え",
"君がため惜しからざりし命さへ",
"かくとだにえやはいぶきのさしも草",
"あけぬれば暮るるものとはしりながら",
"嘆きつつひとり寝る夜のあくるまは",
"忘れじのゆくすゑまではかたければ",
"滝の音はたえて久しくなりぬれど",
"あらぎらむこの世のほかの思ひ出に",
"めぐりあひてめしやそれともわかぬまに",
"ありま山ゐなの笹原風吹けば",
"やすらはで寝なましものをさ夜ふけて",
"大江山いく野の道の遠ければ",
"いにしへの奈良の都の八重桜",
"夜をこめて鳥のそらねんははかるとも",
"いまはただ思ひ絶えなむとばかりを",
"朝ぼらけ宇治の川霧たえだえに",
"うらみわびほさぬ袖だにあるものを",
"もろともにあはれと思へ山桜",
"春の夜の夢ばかりなる手枕に",
"心にもあらでうき世にながらへば",
"あらしふく三室の山のもみぢばは",
"さびしさに宿をたちいでてながむれば",
"夕されば門田の稲葉おとづれて",
"音にきくたかしの浜のあだ波は",
"かみさ後のをのへの桜咲きにけり",
"憂かりける人を初瀬の山おろしよ",
"ちぎりおきしさせもが露をいのちにて",
"わたの原こぎいでてみれば久方の",
"瀬をはやみ岩にせかるる滝川の",
"淡路島かよふ千鳥のなく声に",
"秋風にたなびく雲のたえ間より",
"長からむ心もしらず黒髪の",
"ほととぎす鳴きつる方をながむれば",
"思ひわびさてもいのちはあるものを",
"世の中よ道こそなけれ思ひ入る",
"ながらへばまたこのごろやしのばれむ",
"夜もすがら思ふころは明けやらで",
"なげけとて月やは物を思はする",
"村雨の露もまだひぬまきの葉に",
"難破江の葦のかりねのひとよゆゑ",
"玉の緒よたえなばたえねながらへば",
"見せばやな雄島のあまの袖だにも",
"きりぎりす鳴くや霜夜のさむしろに",
"我が袖は潮干に見えぬ沖の石の",
"世の中のつねにもがもななぎさこぐ",
"み吉野の山の秋風さ夜ふけて",
"おほけなくうき世の民におほふかな",
"花さそ嵐の庭の雪ならで",
"こぬ人をまつほの浦の夕なぎに",
"風そよぐならの小川の夕ぐれは",
"人もをし人もうらめしあぢきなく"]

sdata = ["わが衣手に露はぬれつつ",
"衣ほすてふ天の香具山",
"ながながし夜をひとりかも寝む",
"富士の高嶺に雪は降りつつ",
"声聞く時ぞ秋はかなしき",
"白きを見れば夜ぞふけにける",
"三笠の山にいでし月かも",
"世をうぢ山と人はいふなり",
"わが身よにふるながめせしまに",
"知るも知らぬもあふ坂の関",
"人には告げよあまのつり舟",
"をとめの姿しばしとどめむ",
"恋ぞつもりて淵となりぬる",
"乱れそめにしわれならなくに",
"わが衣手に雪はふりつつ",
"まつとし聞かば今帰り来む",
"からくれなゐに水くくるとは",
"夢通ひ路人めよくらむ",
"あはでこの世をすぐしてよとや",
"みをつくしてもあはむとぞ思ふ",
"ありあけの月を待ちいでるつるかな",
"むべ山風を嵐をいふらむ",
"わが身ひとつの秋にはあらねど",
"もみぢの錦神のまにまに",
"人にしられでくるよしもがな",
"いまひとたびのみゆき待たなむ",
"いつ見きとてか恋したるらむ",
"ひとめも草もかれぬと思へば",
"おきまどはせる白菊の花",
"あかつきばかりうきものはなし",
"吉野の里にふれる白雪",
"流れもあへぬもみぢなりけり",
"しづ心なく花のちるらむ",
"松も昔も友ならなくに",
"花ぞ昔の香ににほひける",
"雲のいづこに月やどるらむ",
"つらぬきとめぬ玉ぞ散りける",
"人のいのちの惜しくもあるかな",
"あまりてなどか人の恋しき",
"物や思ふと人のとふまで",
"人知れずこそ思ひそめしか",
"末の松山波こさじとは",
"昔は物を思はざりけり",
"人をも身をも恨みざらまし",
"身のいたづらになりぬべきかな",
"ゆくも知らぬ恋の道かな",
"人こそ見えね秋は来にけり",
"くだけて物を思ふころかな",
"昼は消えつつ物をこそ思へ",
"長くもがなと思ひけるかな",
"さしもしらじなもゆる思ひを",
"なほうらめしき朝ぼらけかな",
"いかに久しきものとかはしる",
"今日をかぎりのいのちともがな",
"名こそ流れてなほ聞こえけれ",
"いまひとたびのあふこともがな",
"雲隠れにし夜半の月かな",
"いでそよ人を忘れやはする",
"かたぶくまでの月を見しかな",
"まだふみも見ず天の橋立",
"けふ九重ににほひけるかな",
"よに逢坂の関はゆるさじ",
"人づてならで言ふよしもがな",
"あらはれわたる瀬々の網代木",
"恋にくちなむ名こそをしけれ",
"花よりほかにしる人もなし",
"かひなくたたむ名こそをしけれ",
"恋しかるべき夜半の月かな",
"竜田の川の錦なりけり",
"いづこもおなじ秋の夕暮れ",
"葦のまろやに秋風ぞ吹く",
"かけじや袖のぬれもこそすれ",
"外山のかすみただずもあらなむ",
"はげしかれとは折らぬものを",
"あはれ今年の秋もいぬめり",
"雲ゐにまがふ沖つ白波",
"われても末にあはむとぞ思ふ",
"幾夜ねざめぬ須磨の関守",
"もれいづる月の影のさやけさ",
"みだれてけさは物をこそ思へ",
"ただありあけの月ぞ残れる",
"憂きにたへぬは涙なりけり",
"山の奥にも鹿ぞ鳴くなる",
"憂しと見し世ぞ今は恋しき",
"閨のひまさへつれなかりけり",
"かこち顔なるわが涙かな",
"霧たちのぼる秋の夕暮れ",
"みをつくしてや恋ひわたるべき",
"忍ぶることの弱りもぞする",
"ぬれにぞぬれし色のはかはらず",
"衣かたしきひとりかも寝む",
"人こそしらねかわくまもなし",
"あまの小舟のつなでかなしも",
"ふるさと寒く衣うつなり",
"わがたつ杣に黒染めの袖",
"ふりゆくものは我が身なりけり",
"焼くやもしほの身もこがれつつ",
"みそぎぞ夏のしるしなりける",
"世を思ふゆゑに物思ふ身は"]

def printq(trueans, returnlist):
	print unicode(kdata[trueans], 'utf-8')
	f = 0
	for i in returnlist:
		f = f + 1
		print str(f) + u"." + str(sdata[i])

def howmany():
	how = int(raw_input(u"howmanytimes(<101):"))
	if how > 101:
		howmany()
	return how

def main():
	per = 0
	returnlist = []
	leftlist = []
	how = howmany()
	for i in range(0,100):
		leftlist.append(int(i))

	for i in range(how):
		print u"----------"
		random.shuffle(leftlist)
		trueans = leftlist[0]
		returnlist.append(trueans)
		for k in range(3):
			returnlist.append(random.randint(0,99))
		random.shuffle(returnlist)

		printq(trueans, returnlist)
		ans = raw_input(u"ans:")

		if returnlist[int(ans)-1] == trueans:
			print u"right."
			per = per + 1.0
		else:
			print u"wrong"
		print u"ans:" + str(kdata[trueans]) + u" " + str(sdata[trueans]) + u" :" + str(trueans)
		del returnlist[:]
	print str(100 * per / how) + u"% (" + str(int(per)) + u"/" + str(how) + u")" 

if __name__ == '__main__':
	main()
	raw_input('Press return key.')
